In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

Acceso al [Kaggle](https://www.kaggle.com/datasets/yashkmd/credit-profile-two-wheeler-loan-dataset)
- Se puede plantear un problema de regresión con el score.
- Se puede plantear un problema de clasificación con un umbral (o varios) para ver si pasa o no.

In [3]:
# Generamos el dataset
credit = pd.read_csv('credit_data.csv')
credit.head()

,Age,Gender,Income,Credit Score,Credit History Length,Number of Existing Loans,Loan Amount,Loan Tenure,Existing Customer,State,City,LTV Ratio,Employment Profile,Profile Score,Occupation
0,31,Male,36000,604,487,5,109373,221,No,Karnataka,Mysuru,90.943430,Salaried,77,Doctor
1,25,Male,50000,447,386,2,150000,89,No,Karnataka,Bengaluru,91.135253,Salaried,43,Software Engineer
2,62,Other,178000,850,503,10,69099,110,Yes,Uttar Pradesh,Kanpur,40.000000,Salaried,90,Banker
3,69,Female,46000,668,349,6,150000,148,Yes,Karnataka,Bengaluru,87.393365,Self-Employed,86,Contractor
4,52,Male,132000,601,553,5,150000,157,No,Karnataka,Mysuru,66.158757,Salaried,90,Teacher

In [4]:
# Revisamos la información de las columnas
credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279856 entries, 0 to 279855
Data columns (total 15 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   Age                       279856 non-null  int64
 1   Gender                    279856 non-null  object
 2   Income                    279856 non-null  int64
 3   Credit Score              279856 non-null  int64
 4   Credit History Length     279856 non-null  int64
 5   Number of Existing Loans  279856 non-null  int64
 6   Loan Amount               279856 non-null  int64
 7   Loan Tenure               279856 non-null  int64
 8   Existing Customer         279856 non-null  object
 9   State                     279856 non-null  object
 10  City                      279856 non-null  object
 11  LTV Ratio                 279856 non-null  float64
 12  Employment Profile        279856 non-null  object
 13  Profile Score             279856 non-null  int64
 14  Occupation                261584 non-null  object
dtypes: float64(1), int64(8), object(6)
memory usage: 32.0+ MB